app/controllers/concerns/api/v1/airlines_controller.rb

			def index
				airlines = Airline.all
---
SELECT "airlines".* FROM "airlines"

			def show
				airline = Airline.find_by(slug: params[:slug])
---
SELECT  "airlines".* FROM "airlines" WHERE "airlines"."slug" = $1 LIMIT $2  [["slug", "fake-airlines"], ["LIMIT", 1]]

			def update
				airline = Airline.find_by(slug: params[:slug])

				if airline.update(airline_params)
---
SELECT  "airlines".* FROM "airlines" WHERE "airlines"."slug" = $1 LIMIT $2  [["slug", "fake-airline"], ["LIMIT", 1]]
UPDATE "airlines" SET "name" = $1, "updated_at" = $2 WHERE "airlines"."id" = $3  [["name", "other fake airline"], ["updated_at", "2022-11-27 04:22:24.896572"], ["id", 37]]

			def destroy
				airline = Airline.find_by(slug: params[:slug])
				if airline.destroy
---
SELECT  "airlines".* FROM "airlines" WHERE "airlines"."slug" = $1 LIMIT $2  [["slug", "fake-airline"], ["LIMIT", 1]]
DELETE FROM "airlines" WHERE "airlines"."id" = $1  [["id", 37]]

			def create
				airline = Airline.new(airline_params)

				if airline.save
---
INSERT INTO "airlines" ("name", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "fake-airline"], ["slug", "fake-airline"], ["created_at", "2022-11-27 04:33:40.473619"], ["updated_at", "2022-11-27 04:33:40.473619"]]