app/controllers/concerns/api/v1/reviews_controller.rb

INSERT INTO "reviews" ("title", "description", "score", "airline_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "review1"], ["description", "description"], ["score", 5], ["airline_id", 1], ["created_at", "2022-11-27 04:39:45.604955"], ["updated_at", "2022-11-27 04:39:45.604955"]]
---
		def create
			review = Review.new(review_params)

			if review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]
---
		def destroy
			review = Review.find(params[:id])

			if review.destroy